package cn.ahpu.string.regex;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class 匹配汉字 {
    public static void main(String[] args) {
/*        String str1 = "視線（しせん）を高（たか)く、遠（とお)くすると、いろんなことが見（み)えてくる。それは、ずっと続（つづ)いている道（みち)や、行（い)きたいなあと思（おもう)場所（ばしょ)、大切（たいせつ)にしておきたいことや、感謝（かんしゃ)する心（こころ）、など。\n" +
                "\n" +
                "抬头向远处望，可以看1234455见不同的风景。\n" +
                "\n" +
                "那里有绵延的道路，那里有世外桃源，那里有你所渴望珍惜的，那里有很多重要的，有你所感激的，等等。\n" +
                "\n" +
                "だから、時々（ときどき)は、明456789日（あした)考（かん)がえればいいことは、明日までとっておこう。そのかわり、残（の)こった時間（じかん)を好（す)きなことをしたり、のんびりしたりしてすごすようにしてみよう。人生（じんせい)には、たまに、そうやって、「まっ、今日（きょう)はいいかっ」と思（おも）うことも必要（ひつよう)。だから、今夜（こんや)の仕事（しごと)を早（はや)く切（き)り上（あ)げて、やりたいことをしてゆっくり過（す)ごそう。\n" +
                "\n" +
                "有时候，明天可以做的事情可以放到明天。这样剩下的时间做自己喜欢做的事，悠闲的度过一天。人生偶尔也需要这样，给疲惫的今天放个假留给明天去做。不妨今天到此结束，做自己喜欢做的事。\n" +
                "\n" +
                "焼（や)きたてのパン（ぱん)の香（かお)りや、コトコトいってる鍋（なべ)の音（おと)、雨上（あめあ)がりの草（くさ)のにおいや、理由（りゆう)の見当（みあ)たらない幸福感（こうふくかん)、といったもの。\n" +
                "\n" +
                "快烤好的面包扑鼻香味，锅里快煮熟0987652咕噜声，春雨过后草地上飘来的清香，这些理由都是我们幸福感的原因。";*/
        //表示汉字：[一-龥] 匹配出234;  [\u4E00-\u9FA5]匹配中文简体、繁体、部分日文、 匹配出234
        //^[一-龥]+& 匹配以汉字开始，以汉字结束串
//        String regex = "[\\u4E00-\\u9FA5]";

/*        String str1="123456";
        String regex="^[1-9][0-9]{5}$";//完全匹配：^[1-9][0-9]{5}$等价^[1-9]//d{5}$          str1需完全匹配regex格式才行 如：123456、234521*/


        String str1="https://www.bilibili.com/video/BV1Eq4y1E79W?p=17&spm_id_from=pageDriver&vd_source=a624d5626dc0011dc56bfc4cc466feb4";
        String regex="^(http|https)://";//以^开始的符号串，只要有存在就行；^与$组合必须完全匹配才行

        Pattern pattern = Pattern.compile(regex);
        Matcher matcher = pattern.matcher(str1);
        int count=0;
        while (matcher.find()) {
            System.out.println(++count+":"+matcher.group(0));//组0代表匹配到子字符串
        }
    }
}
